
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПоступлениеТоваровПоСпецификациям.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ПоступлениеТоваровПоСпецификациям.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Спецификация = ТекСтрокаТовары.Спецификация;
		Движение.НомерПоСпецификации = ТекСтрокаТовары.НомерПоСпецификации;
		Движение.НоменклатураКлиента = ТекСтрокаТовары.НоменклатураКлиента;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Поставщик = Поставщик;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;

КонецПроцедуры
