
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt";
	Диалог.Заголовок = "Выберитие файл с настройками соединения";
	Диалог.МножественныйВыбор = Ложь;
	
	ФайлНастроек = "";
	
	Если Диалог.Выбрать() Тогда
        ФайлНастроек = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
	Если ФайлНастроек = "" Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;       
	ТекстовыйДокумент.Прочитать(ФайлНастроек,КодировкаТекста.UTF8);
	
	НастройкиОбмена = Новый Структура;
	НастройкиОбмена.Вставить("Адрес"				,ТекстовыйДокумент.ПолучитьСтроку(1));
	НастройкиОбмена.Вставить("Порт"					,Число(ТекстовыйДокумент.ПолучитьСтроку(2)));
	НастройкиОбмена.Вставить("Логин"				,ТекстовыйДокумент.ПолучитьСтроку(3));
	НастройкиОбмена.Вставить("Пароль"				,ТекстовыйДокумент.ПолучитьСтроку(4));
	НастройкиОбмена.Вставить("Хост"					,ТекстовыйДокумент.ПолучитьСтроку(5));
	НастройкиОбмена.Вставить("Точка"				,ТекстовыйДокумент.ПолучитьСтроку(6));
	НастройкиОбмена.Вставить("Ключ"					,ТекстовыйДокумент.ПолучитьСтроку(7));
	НастройкиОбмена.Вставить("Очередь"				,ТекстовыйДокумент.ПолучитьСтроку(8));
	
	ЗагрузитьИзФайлаНаСервере(НастройкиОбмена);   
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(НастройкиОбмена)

	НаборЗаписей = РегистрыСведений.НастройкиОбменаRMQ.СоздатьНаборЗаписей();  

	Для каждого Настройка Из НастройкиОбмена Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Настройка 	= ПланыВидовХарактеристик.НастройкиRMQ.НайтиПоНаименованию(Настройка.Ключ); 
			НоваяЗапись.Значение 	= Настройка.Значение;	 
	
	КонецЦикла;  
	
	НаборЗаписей.Записать(Истина); 

КонецПроцедуры
