
Функция ОтправитьДанные(КаталогОбмена) Экспорт
	Возврат ОбменДаннымиВПБПСервер.ОтправитьДанныеНаСервере(КаталогОбмена);	
КонецФункции

Функция ПолучитьДанные(КаталогОбмена) Экспорт
	Возврат ОбменДаннымиВПБПСервер.ПолучитьДанныеНаСервере(КаталогОбмена);
КонецФункции

Функция ЗарегестрироватьОбъектыДляНачальногоОбмена() Экспорт 
	Возврат ОбменДаннымиВПБПСервер.ЗарегестрироватьОбъектыДляНачальногоОбменаНаСервере();
КонецФункции

Функция ПодготовитьДанные() Экспорт
	Возврат ОбменДаннымиВПБПСервер.ПодготовитьДанныеНаСервере();	
КонецФункции

Функция ПолучитьДанныеИзRMQ(ПолученноеСообщение) Экспорт
	Возврат ОбменДаннымиВПБПСервер.ПолучитьДанныеИзRMQНаСервере(ПолученноеСообщение);
КонецФункции 